FemDesign.Tolerance
Tolerance. This class contains definitions for different project specific tolerances.

FemDesign.Tolerance.Brep
Predefined brep tolerance.

FemDesign.Tolerance.DotProduct
Predefined tolerance when controlling if two vectors, v0 and v1, are perpendicular by assuming v0.Dot(v1) == 0.
Returns:

FemDesign.Tolerance.LengthComparison
Predefined tolernace for length evaluations.

FemDesign.Tolerance.LengthSquared
Predefined tolernace for length evaluations.

FemDesign.Tolerance.Point3d
Predefined point3d tolerance.

FemDesign.Tolerance.Vector3d
Predefined vector3d tolerance.